<?php
/*
	@	helper文件
	@	集合前台index方法
	@	对于文件：同目录common.php文件
*/

// ----------------------------------------->	

	/*
		@	getTime
		@	获取时间，直接调用
	*/
	getTime();

// ----------------------------------------->

	/*
		@	getIp
		@	获取ip，直接调用
	*/	
	getIp();

// ----------------------------------------->

	/*
		@	tableName
		@	获取表名
		@	必传参数：$type->表类型
	*/
	tableName($type);

// ----------------------------------------->

	/*
		@	getOneRowOf
		@	根据条件获取一条信息，返回一维数组
		@	必传参数：
					$type  			-->表
					$willChar		-->条件字段
					$willContent 	-->条件值
	*/
	getOneRowOf($type,$willChar,$willContent);

// ----------------------------------------->
?>